package lessons.lesson12.homeworks
//Задачи на приведение коллекции к значению
//isNotEmpty
//getOrElse
//joinToString
//firstOrNull
//size
//isEmpty
//minOrNull
//contains
//sum
//average
//maxOrNull

//Методы для обработки данных в коллекции
//sorted
//groupBy
//distinct
//take
//takeLast
//filter
//filterNot
//map
//associate
//sortedDescending
//forEach
//filterNotNull

fun main() {
//1. Проверить, что размер коллекции больше 5 элементов.
    val coll1 = listOf(1, 2, 3, 4, 5, 6, 7, 8)
    println(coll1.size > 5)

//2. Проверить, что коллекция пустая
    val coll2 = listOf<Int?>()
    println(coll2.isEmpty())
    println(coll1.isEmpty())

//3. Проверить, что коллекция не пустая
    println(coll1.isNotEmpty())

//4. Взять элемент по индексу или создать значение если индекса не существует
    println(coll1.getOrElse(10) { 13 })

//5. Собрать коллекцию в строку
    println(coll1.joinToString(","))

//6. Посчитать сумму всех значений
    println(coll1.sum())

//7. Посчитать среднее
    println(coll1.average())

//8. Взять максимальное число
    println(coll1.maxOrNull())

//9. Взять минимальное число
    println(coll1.minOrNull())

//10. Взять первое число или null
    println(coll1.firstOrNull())

//11. Проверить что коллекция содержит элемент
    println(coll1.contains(2))

//12. Отфильтровать коллекцию по диапазону 18-30
    val coll12 = listOf(1, 13, 45, 18, 20, 31, 30, 29)
    println(coll12.filter { it in 18..30 })

//13. Выбрать числа, которые не делятся на 2 и 3 одновременно
    println(coll12.filterNot { it % 2 == 0 && it % 3 == 0 })

//14. Очистить текстовую коллекцию от null элементов
    val coll14 = listOf(1, null, 4, 7, 9, null)
    println(coll14.filterNotNull())

//15. Преобразовать текстовую коллекцию в коллекцию длин слов
    val call15 = listOf("qwer", "qw", "asdfghj")
    println(call15.map { it.length })

//16. Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    val call16 = listOf("qwe", "asdf", "zxcvbn", "jhgfgff", "dfsfs")
    println(call16.associate { it.reversed() to it.length })

//17. Отсортировать список в алфавитном порядке
    println(call16.sorted())

//18. Взять первые 3 элемента списка
    println(call16.take(3))

//19. Распечатать квадраты элементов списка
    val call19 = listOf(1, 2, 3, 4, 5, 6, 7, 8)
    println(call19.map { it * it })

//20. Группировать список по первой букве слов
    println(call16.groupBy { it.first() })

//21. Очистить список от дублей
    val call21 = listOf(3, 3, 3, 4, 4, 45, 5, 5, 5)
    println(call21.distinct())

//22. Отсортировать список по убыванию
    println(call19.sortedDescending())

//23. Взять последние 3 элемента списка
    println(call19.takeLast(3))

//24.
    println(numericCollection(emptyList()))                    // Пусто
    println(numericCollection(listOf(1, 2, 3)))                // Короткая
    println(numericCollection(listOf(0, 5, 10, 15, 20)))       // Стартовая
    println(numericCollection(listOf(5000, 5001, 5002)))       // Массивная
    println(numericCollection(listOf(10, 10, 10, 10, 10)))     // Сбалансированная
    println(numericCollection(listOf(3, 14, 100, 200, 300)))   // Пи***тая
    println(numericCollection(listOf(1, 2, 4, 7, 8)))          // Уникальная

//25.
    val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
    println(analysisOfRatings(grades))   // [67, 74, 85]

//26.
    val list = listOf(
        "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы",
        "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф",
        "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка",
        "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска",
        "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница",
        "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик",
        "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
    )
    println(catalogFirstLetter(list))

//27
    val list2 = listOf(
        "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы",
        "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф",
        "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка",
        "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска",
        "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница",
        "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик",
        "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"
    )
    println(avgLength(list))
    // Средняя длина слов: 7.30

//28
    val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
    println(categorizationNumbers(numbers = numbers))

//29
    val ages = listOf(22, 18, 30, 45, 17, null, 60)

    println(findFirst(ages, 18))    // 22
    println(findFirst(ages, 50))    // 60
    println(findFirst(ages, 100))   // null
    println(findFirst(ages, 10))    // 22 — 18 не подходит, т.к. 18 > 10 — да, но 22 первый

}

//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when
//Вызвать метод с данными, подходящими под каждую из веток
fun numericCollection(n: List<Int>): String {
    return when {
        //Если коллекция пустая - “Пусто”
        n.isEmpty() -> "Пусто"
        //Если количество элементов меньше пяти - “Короткая”
        n.size < 5 -> "Короткая"
        //Если коллекция начинается с 0 - “Стартовая”
        n.first() == 0 -> "Стартовая"
        //Если сумма всех чисел больше 10000 - “Массивная”
        n.sum() > 10000 -> "Массивная"
        //Если среднее значение равно 10 - “Сбалансированная”
        n.average() == 10.0 -> "Сбалансированная"
        //Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
        n.joinToString().length == 20 -> "Клейкая"
        //Если максимальное число меньше -10 - “Отрицательная”
        n.max() < -10 -> "Отрицательная"
        //Если минимальное число больше 1000 - “Положительная”
        n.min() > 1000 -> "Положительная"
        //Если содержит одновременно числа 3 и 14 - “Пи***тая”
        n.contains(3) && n.contains(14) -> "Пи***тая"
        //Иначе - “Уникальная”
        else -> "Уникальная"
    }
}

//Задача 25. Анализ учебных оценок
//Напиши функцию, которая принимает список чисел и возвращает список чисел.
//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3.
// Вызывай методы обработки и фильтрации последовательно один из другого,
// чтобы результат предыдущего метода являлся основой для следующего.

fun analysisOfRatings(a: List<Int>): List<Int> {
    return a.filter { it >= 60 }
        .sorted()
        .take(3)
}

//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
//Начальные значения: val list = listOf(
//"Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы",
// "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф",
// "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка",
// "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска",
// "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница",
// "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик",
// "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка")
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy

fun catalogFirstLetter(list: List<String>): Map<Char, List<String>> =
    list.map { it.lowercase() }
        .groupBy { it.first() }

//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//Начальные значения взять из предыдущей задачи.
//Цель: Перевести все слова в количество букв, подсчитать среднее значение.
// Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.

fun avgLength(list2: List<String>): String =
    "Средняя длина слов: %.2f".format(
        list2.map { it.length }
            .average()
    )

//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
//Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).

fun categorizationNumbers(numbers: List<Int>): Map<String, List<Int>> =
    numbers.distinct()
        .sortedDescending()
        .groupBy { if (it % 2 == 0) "четные" else "нечетные" }

//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его,
// либо null если значения не нашлось.

fun findFirst(lis: List<Int?>, a: Int): Int? {
    val first = lis.find { it != null && it > a }
    return first
}