package lessons.lesson13.homeworks

fun main(){

//1. Дан словарь с именем и временем выполнения каждого автоматизированного теста в секундах.
// Определите среднее время выполнения теста.
    val a = mapOf("имя1" to 11.23, "имя2" to 12.00, "имя3" to 50.00)
    var sum = 0.00
    for(entry in a){
        sum += entry.value
    }
    println(sum / a.size)

//2. Имеется словарь с метаданными автоматизированных тестов, где ключи — это имена тестовых методов а значения - строка с метаданными.
// Выведите список всех тестовых методов.
    val b = mapOf("метод1" to "метаданные", "метод2" to "метаданные2", "метод3" to "метаданные3")
    println(b.keys.toList())
    
//3. В изменяемый словарь с данными о прохождении тестов добавьте новый тест и его результат.
    val c = mutableMapOf("тест1" to "результат1", "тест2" to "результат2", "тест3" to "результат3")
    c["тест4"] = "результат4"
    println(c)

//4. Посчитайте количество успешных тестов в словаре с результатами (ключ - название, значение - результат из passed, failed, skipped).
    val d = mapOf("тест1" to "passed", "тест2" to "failed", "тест3" to "skipped", "тест4" to "passed")
    var count = 0
    for(it in d){
        if(it.value == "passed"){
            count ++
        }
    }
    println(count)

//5. Удалите из изменяемого словаря с баг-трекингом запись о баге, который был исправлен (ключ - название, значение - статус исправления).
    val e = mutableMapOf("баг1" to "новый", "баг2" to "в работе", "баг3" to "исправлен", "баг4" to "исправлен")
    e.values.removeAll{it == "исправлен"}
    println(e)

//6. Для словаря с результатами тестирования веб-страниц (ключ — URL страницы, значение — статус ответа),
// выведите сообщение о странице и статусе её проверки.
    val f = mapOf("URL страницы1" to 200, "URL страницы2" to 500, "URL страницы3" to 404, "URL страницы4" to 200)
    f.forEach { println("${it.key} - статус ${it.value}") }

//7. Найдите в словаре с названием и временем ответа сервисов только те, время ответа которых превышает заданный порог.
    val g = mapOf("сервис1" to 50, "сервис2" to 10, "сервис3" to 80, "сервис4" to 30)
    println(g.filter { it.value > 30 })

//8. В словаре хранятся результаты тестирования API (ключ — endpoint, значение — статус ответа в виде строки).
// Для указанного endpoint найдите статус ответа, если endpoint отсутствует, предположите, что он не был протестирован.
    val h = mapOf("endpoint1" to "200", "endpoint2" to "200", "endpoint3" to "500", "endpoint4" to "404")
    println(h.getOrDefault("endpoint3", "не протестирован"))
    println(h.getOrDefault("endpoint13", "не протестирован"))

//9. Из словаря, содержащего конфигурации тестового окружения (ключ — название параметра конфигурации, значение - сама конфигурация),
// получите значение для "browserType". Ответ не может быть null.
    val i = mapOf("параметр1" to "конфигурация1", "параметр2" to "конфигурация2", "параметр3" to "конфигурация3", "browserType" to "конфигурация4")
    println(i.getValue("browserType"))

//10. Создайте копию неизменяемого словаря с данными о версиях тестируемого ПО, добавив новую версию.
    val j = mapOf("параметр1" to 1, "параметр2" to 2, "параметр3" to 3)
    val k = j + ("параметр4" to 4)

//11. Используя словарь с настройками тестирования для различных мобильных устройств (ключ — модель устройства, значение - строка с настройками),
// получите настройки для конкретной модели или верните настройки по умолчанию.
    val l = mapOf("модель устройства1" to "строка с настройками1", "модель устройства2" to "строка с настройками2", "модель устройства3" to "строка с настройками3")
    println(l.getOrDefault("модель устройства1", "настройки по умолчанию"))
    println(l.getOrDefault("модель устройства11", "настройки по умолчанию"))

//12. Проверьте, содержит ли словарь с ошибками тестирования (ключ - код ошибки, значение - описание ошибки) определенный код ошибки.
    val m = mapOf("код ошибки1" to "описание ошибки1", "код ошибки2" to "описание ошибки2", "код ошибки3" to "описание ошибки3")
    println(m.containsKey("код ошибки2"))

//13. Дан неизменяемый словарь, где ключи — это идентификаторы тестовых сценариев в формате "TestID_Version",
// а значения — статусы выполнения этих тестов ("Passed", "Failed", "Skipped").
// Отфильтруйте словарь, оставив только те сценарии, идентификаторы которых соответствуют определённой версии тестов,
// то-есть в ключе содержится требуемая версия.
    val n = mapOf("TestID_Version1" to "Passed", "TestID_Version2" to "Failed", "TestID_Version3" to "Skipped")
    println(n.filterKeys { it.contains("Version1") })

//14. У вас есть словарь, где ключи — это названия функциональных модулей приложения, а значения — результаты их тестирования.
// Проверьте, есть ли модули с неудачным тестированием.
    val o = mapOf("модуль1" to "Passed", "модуль2" to "Failed", "модуль3" to "Skipped")
    println(o.any { it.value == "Failed" })

//15. Добавьте в изменяемый словарь с настройками тестовой среды настройки из другого словаря.
    val p = mutableMapOf("среда1" to "настройки1", "среда2" to "настройки2", "среда3" to "настройки3")
    val q = mutableMapOf("среда4" to "настройки4")
    p.putAll(q)
    println(p)

//16. Объедините два неизменяемых словаря с данными о багах.
    val r = mapOf("баг1" to "New", "баг2" to "Closed", "баг3" to "In progress")
    val s = mapOf("баг4" to "New", "баг5" to "Closed", "баг6" to "In progress")
    val t = r + s
    println(t)

//17. Очистите изменяемый словарь с временными данными о последнем прогоне автоматизированных тестов.
    val u = mutableMapOf("тест1" to 11.23, "тест2" to 12.00, "тест3" to 50.00)
    u.clear()
    println(u)

//18. Исключите из отчета по автоматизированному тестированию те случаи, где тесты были пропущены (имеют статус “skipped”).
// Ключи - название теста, значения - статус.
    val v = mutableMapOf("название теста1" to "Passed", "название теста2" to "Failed", "название теста3" to "Skipped")
    v.values.removeAll { it == "Skipped" }
    println(v)

//19. Создайте копию словаря с конфигурациями тестирования удалив из него несколько конфигураций.
    val w = mutableMapOf("конфигурация1" to "настройки1", "конфигурация2" to "настройки2", "конфигурация3" to "настройки3")
    val x = w - setOf("конфигурация1", "конфигурация2")
    println(x)

//20. Создайте отчет о тестировании, преобразовав словарь с результатами тестирования
// (ключ — идентификатор теста, значение — результат) в список строк формата "Test ID: результат".
    val y = mutableMapOf("название теста1" to "Passed", "название теста2" to "Failed", "название теста3" to "Skipped")
    val z = y.map { "${it.key}: ${it.value}" }
    println(z)

//21. Преобразуйте изменяемый словарь с результатами последнего тестирования в неизменяемый для архивации.
    val aa = mutableMapOf("название теста1" to "Passed", "название теста2" to "Failed", "название теста3" to "Skipped")
    val bb = aa.toMap()
    println(bb)

//22. Преобразуйте словарь, содержащий числовой ID теста и данные о времени выполнения тестов,
// заменив идентификаторы тестов на их строковый аналог (например через toString()).
    val cc = mutableMapOf(1 to 11.23, 2 to 12.00, 3 to 50.00)
    val ccString = cc.mapKeys { it.key.toString() }.toMutableMap()
    println(ccString)

//23 Для словаря с оценками производительности различных версий приложения (ключи - строковая версия, значения - дробное число времени ответа сервера)
// увеличьте каждую оценку на 10%, чтобы учесть новые условия тестирования.
    val dd = mutableMapOf("версия1" to 11.23, "версия2" to 12.00, "версия3" to 50.00)
    val ee = dd.mapValues { it.value * 1.1 }
    println(ee)

//24. Проверьте, пуст ли словарь с ошибками компиляции тестов.
    val ff = mutableMapOf("ошибка1" to "текст ошибки1", "ошибка2" to "текст ошибки2", "ошибка3" to "текст ошибки3")
    println(ff.isEmpty())

//25. Убедитесь, что словарь с результатами нагрузочного тестирования не пуст.
    val gg = mutableMapOf("результат1" to "текст ошибки1", "результат2" to "текст ошибки2", "результат3" to "текст ошибки3")
    println(gg.isNotEmpty())

//26. Проверьте, прошли ли успешно все автоматизированные тесты в словаре с результатами.
    val hh = mapOf("TestID_Version1" to "Passed", "TestID_Version2" to "Failed", "TestID_Version3" to "Skipped")
    println(hh.all { it.value == "Passed" })

//27. Определите, содержит ли словарь с результатами тестирования хотя бы один тест с ошибкой.
    val ii = mapOf("TestID_Version1" to "Passed", "TestID_Version2" to "Failed", "TestID_Version3" to "Skipped")
    println(ii.any { it.value == "Failed" })

//28. Отфильтруйте словарь с результатами тестирования сервисов, оставив только те тесты, которые не прошли успешно и содержат в названии “optional”.
    val jj = mapOf("TestID_Version1 optional" to "Passed", "TestID_Version2 optional" to "Failed", "TestID_Version3" to "Skipped")
    val result = jj.filter {
        "optional" in it.key && it.value != "Passed"
    }
    println(result)

}